/* automatically generated by rust-bindgen 0.72.0 */

pub const _IOC_NRBITS: u32 = 8;
pub const _IOC_TYPEBITS: u32 = 8;
pub const _IOC_SIZEBITS: u32 = 14;
pub const _IOC_DIRBITS: u32 = 2;
pub const _IOC_NRMASK: u32 = 255;
pub const _IOC_TYPEMASK: u32 = 255;
pub const _IOC_SIZEMASK: u32 = 16383;
pub const _IOC_DIRMASK: u32 = 3;
pub const _IOC_NRSHIFT: u32 = 0;
pub const _IOC_TYPESHIFT: u32 = 8;
pub const _IOC_SIZESHIFT: u32 = 16;
pub const _IOC_DIRSHIFT: u32 = 30;
pub const _IOC_NONE: u32 = 0;
pub const _IOC_WRITE: u32 = 1;
pub const _IOC_READ: u32 = 2;
pub const IOC_IN: u32 = 1073741824;
pub const IOC_OUT: u32 = 2147483648;
pub const IOC_INOUT: u32 = 3221225472;
pub const IOCSIZE_MASK: u32 = 1073676288;
pub const IOCSIZE_SHIFT: u32 = 16;
pub const __BITS_PER_LONG: u32 = 64;
pub const __BITS_PER_LONG_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const IOMMUFD_TYPE: u8 = 59u8;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
pub const IOMMUFD_CMD_BASE: _bindgen_ty_1 = 128;
pub const IOMMUFD_CMD_DESTROY: _bindgen_ty_1 = 128;
pub const IOMMUFD_CMD_IOAS_ALLOC: _bindgen_ty_1 = 129;
pub const IOMMUFD_CMD_IOAS_ALLOW_IOVAS: _bindgen_ty_1 = 130;
pub const IOMMUFD_CMD_IOAS_COPY: _bindgen_ty_1 = 131;
pub const IOMMUFD_CMD_IOAS_IOVA_RANGES: _bindgen_ty_1 = 132;
pub const IOMMUFD_CMD_IOAS_MAP: _bindgen_ty_1 = 133;
pub const IOMMUFD_CMD_IOAS_UNMAP: _bindgen_ty_1 = 134;
pub const IOMMUFD_CMD_OPTION: _bindgen_ty_1 = 135;
pub const IOMMUFD_CMD_VFIO_IOAS: _bindgen_ty_1 = 136;
pub const IOMMUFD_CMD_HWPT_ALLOC: _bindgen_ty_1 = 137;
pub const IOMMUFD_CMD_GET_HW_INFO: _bindgen_ty_1 = 138;
pub const IOMMUFD_CMD_HWPT_SET_DIRTY_TRACKING: _bindgen_ty_1 = 139;
pub const IOMMUFD_CMD_HWPT_GET_DIRTY_BITMAP: _bindgen_ty_1 = 140;
pub const IOMMUFD_CMD_HWPT_INVALIDATE: _bindgen_ty_1 = 141;
pub const IOMMUFD_CMD_FAULT_QUEUE_ALLOC: _bindgen_ty_1 = 142;
pub const IOMMUFD_CMD_IOAS_MAP_FILE: _bindgen_ty_1 = 143;
pub const IOMMUFD_CMD_VIOMMU_ALLOC: _bindgen_ty_1 = 144;
pub const IOMMUFD_CMD_VDEVICE_ALLOC: _bindgen_ty_1 = 145;
pub const IOMMUFD_CMD_IOAS_CHANGE_PROCESS: _bindgen_ty_1 = 146;
pub const IOMMUFD_CMD_VEVENTQ_ALLOC: _bindgen_ty_1 = 147;
#[doc = " DOC: General ioctl format\n\n The ioctl interface follows a general format to allow for extensibility. Each\n ioctl is passed in a structure pointer as the argument providing the size of\n the structure in the first u32. The kernel checks that any structure space\n beyond what it understands is 0. This allows userspace to use the backward\n compatible portion while consistently using the newer, larger, structures.\n\n ioctls use a standard meaning for common errnos:\n\n  - ENOTTY: The IOCTL number itself is not supported at all\n  - E2BIG: The IOCTL number is supported, but the provided structure has\n    non-zero in a part the kernel does not understand.\n  - EOPNOTSUPP: The IOCTL number is supported, and the structure is\n    understood, however a known field has a value the kernel does not\n    understand or support.\n  - EINVAL: Everything about the IOCTL was understood, but a field is not\n    correct.\n  - ENOENT: An ID or IOVA provided does not exist.\n  - ENOMEM: Out of memory.\n  - EOVERFLOW: Mathematics overflowed.\n\n As well as additional errnos, within specific ioctls."]
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[doc = " struct iommu_destroy - ioctl(IOMMU_DESTROY)\n @size: sizeof(struct iommu_destroy)\n @id: iommufd object ID to destroy. Can be any destroyable object type.\n\n Destroy any object held within iommufd."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_destroy {
    pub size: __u32,
    pub id: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_destroy"][::std::mem::size_of::<iommu_destroy>() - 8usize];
    ["Alignment of iommu_destroy"][::std::mem::align_of::<iommu_destroy>() - 4usize];
    ["Offset of field: iommu_destroy::size"][::std::mem::offset_of!(iommu_destroy, size) - 0usize];
    ["Offset of field: iommu_destroy::id"][::std::mem::offset_of!(iommu_destroy, id) - 4usize];
};
#[doc = " struct iommu_ioas_alloc - ioctl(IOMMU_IOAS_ALLOC)\n @size: sizeof(struct iommu_ioas_alloc)\n @flags: Must be 0\n @out_ioas_id: Output IOAS ID for the allocated object\n\n Allocate an IO Address Space (IOAS) which holds an IO Virtual Address (IOVA)\n to memory mapping."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_alloc {
    pub size: __u32,
    pub flags: __u32,
    pub out_ioas_id: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_alloc"][::std::mem::size_of::<iommu_ioas_alloc>() - 12usize];
    ["Alignment of iommu_ioas_alloc"][::std::mem::align_of::<iommu_ioas_alloc>() - 4usize];
    ["Offset of field: iommu_ioas_alloc::size"]
        [::std::mem::offset_of!(iommu_ioas_alloc, size) - 0usize];
    ["Offset of field: iommu_ioas_alloc::flags"]
        [::std::mem::offset_of!(iommu_ioas_alloc, flags) - 4usize];
    ["Offset of field: iommu_ioas_alloc::out_ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_alloc, out_ioas_id) - 8usize];
};
#[doc = " struct iommu_iova_range - ioctl(IOMMU_IOVA_RANGE)\n @start: First IOVA\n @last: Inclusive last IOVA\n\n An interval in IOVA space."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_iova_range {
    pub start: __u64,
    pub last: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_iova_range"][::std::mem::size_of::<iommu_iova_range>() - 16usize];
    ["Alignment of iommu_iova_range"][::std::mem::align_of::<iommu_iova_range>() - 8usize];
    ["Offset of field: iommu_iova_range::start"]
        [::std::mem::offset_of!(iommu_iova_range, start) - 0usize];
    ["Offset of field: iommu_iova_range::last"]
        [::std::mem::offset_of!(iommu_iova_range, last) - 8usize];
};
#[doc = " struct iommu_ioas_iova_ranges - ioctl(IOMMU_IOAS_IOVA_RANGES)\n @size: sizeof(struct iommu_ioas_iova_ranges)\n @ioas_id: IOAS ID to read ranges from\n @num_iovas: Input/Output total number of ranges in the IOAS\n @__reserved: Must be 0\n @allowed_iovas: Pointer to the output array of struct iommu_iova_range\n @out_iova_alignment: Minimum alignment required for mapping IOVA\n\n Query an IOAS for ranges of allowed IOVAs. Mapping IOVA outside these ranges\n is not allowed. num_iovas will be set to the total number of iovas and\n the allowed_iovas[] will be filled in as space permits.\n\n The allowed ranges are dependent on the HW path the DMA operation takes, and\n can change during the lifetime of the IOAS. A fresh empty IOAS will have a\n full range, and each attached device will narrow the ranges based on that\n device's HW restrictions. Detaching a device can widen the ranges. Userspace\n should query ranges after every attach/detach to know what IOVAs are valid\n for mapping.\n\n On input num_iovas is the length of the allowed_iovas array. On output it is\n the total number of iovas filled in. The ioctl will return -EMSGSIZE and set\n num_iovas to the required value if num_iovas is too small. In this case the\n caller should allocate a larger output array and re-issue the ioctl.\n\n out_iova_alignment returns the minimum IOVA alignment that can be given\n to IOMMU_IOAS_MAP/COPY. IOVA's must satisfy::\n\n   starting_iova % out_iova_alignment == 0\n   (starting_iova + length) % out_iova_alignment == 0\n\n out_iova_alignment can be 1 indicating any IOVA is allowed. It cannot\n be higher than the system PAGE_SIZE."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_iova_ranges {
    pub size: __u32,
    pub ioas_id: __u32,
    pub num_iovas: __u32,
    pub __reserved: __u32,
    pub allowed_iovas: __u64,
    pub out_iova_alignment: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_iova_ranges"][::std::mem::size_of::<iommu_ioas_iova_ranges>() - 32usize];
    ["Alignment of iommu_ioas_iova_ranges"]
        [::std::mem::align_of::<iommu_ioas_iova_ranges>() - 8usize];
    ["Offset of field: iommu_ioas_iova_ranges::size"]
        [::std::mem::offset_of!(iommu_ioas_iova_ranges, size) - 0usize];
    ["Offset of field: iommu_ioas_iova_ranges::ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_iova_ranges, ioas_id) - 4usize];
    ["Offset of field: iommu_ioas_iova_ranges::num_iovas"]
        [::std::mem::offset_of!(iommu_ioas_iova_ranges, num_iovas) - 8usize];
    ["Offset of field: iommu_ioas_iova_ranges::__reserved"]
        [::std::mem::offset_of!(iommu_ioas_iova_ranges, __reserved) - 12usize];
    ["Offset of field: iommu_ioas_iova_ranges::allowed_iovas"]
        [::std::mem::offset_of!(iommu_ioas_iova_ranges, allowed_iovas) - 16usize];
    ["Offset of field: iommu_ioas_iova_ranges::out_iova_alignment"]
        [::std::mem::offset_of!(iommu_ioas_iova_ranges, out_iova_alignment) - 24usize];
};
#[doc = " struct iommu_ioas_allow_iovas - ioctl(IOMMU_IOAS_ALLOW_IOVAS)\n @size: sizeof(struct iommu_ioas_allow_iovas)\n @ioas_id: IOAS ID to allow IOVAs from\n @num_iovas: Input/Output total number of ranges in the IOAS\n @__reserved: Must be 0\n @allowed_iovas: Pointer to array of struct iommu_iova_range\n\n Ensure a range of IOVAs are always available for allocation. If this call\n succeeds then IOMMU_IOAS_IOVA_RANGES will never return a list of IOVA ranges\n that are narrower than the ranges provided here. This call will fail if\n IOMMU_IOAS_IOVA_RANGES is currently narrower than the given ranges.\n\n When an IOAS is first created the IOVA_RANGES will be maximally sized, and as\n devices are attached the IOVA will narrow based on the device restrictions.\n When an allowed range is specified any narrowing will be refused, ie device\n attachment can fail if the device requires limiting within the allowed range.\n\n Automatic IOVA allocation is also impacted by this call. MAP will only\n allocate within the allowed IOVAs if they are present.\n\n This call replaces the entire allowed list with the given list."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_allow_iovas {
    pub size: __u32,
    pub ioas_id: __u32,
    pub num_iovas: __u32,
    pub __reserved: __u32,
    pub allowed_iovas: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_allow_iovas"][::std::mem::size_of::<iommu_ioas_allow_iovas>() - 24usize];
    ["Alignment of iommu_ioas_allow_iovas"]
        [::std::mem::align_of::<iommu_ioas_allow_iovas>() - 8usize];
    ["Offset of field: iommu_ioas_allow_iovas::size"]
        [::std::mem::offset_of!(iommu_ioas_allow_iovas, size) - 0usize];
    ["Offset of field: iommu_ioas_allow_iovas::ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_allow_iovas, ioas_id) - 4usize];
    ["Offset of field: iommu_ioas_allow_iovas::num_iovas"]
        [::std::mem::offset_of!(iommu_ioas_allow_iovas, num_iovas) - 8usize];
    ["Offset of field: iommu_ioas_allow_iovas::__reserved"]
        [::std::mem::offset_of!(iommu_ioas_allow_iovas, __reserved) - 12usize];
    ["Offset of field: iommu_ioas_allow_iovas::allowed_iovas"]
        [::std::mem::offset_of!(iommu_ioas_allow_iovas, allowed_iovas) - 16usize];
};
pub const iommufd_ioas_map_flags_IOMMU_IOAS_MAP_FIXED_IOVA: iommufd_ioas_map_flags = 1;
pub const iommufd_ioas_map_flags_IOMMU_IOAS_MAP_WRITEABLE: iommufd_ioas_map_flags = 2;
pub const iommufd_ioas_map_flags_IOMMU_IOAS_MAP_READABLE: iommufd_ioas_map_flags = 4;
#[doc = " enum iommufd_ioas_map_flags - Flags for map and copy\n @IOMMU_IOAS_MAP_FIXED_IOVA: If clear the kernel will compute an appropriate\n                             IOVA to place the mapping at\n @IOMMU_IOAS_MAP_WRITEABLE: DMA is allowed to write to this mapping\n @IOMMU_IOAS_MAP_READABLE: DMA is allowed to read from this mapping"]
pub type iommufd_ioas_map_flags = ::std::os::raw::c_uint;
#[doc = " struct iommu_ioas_map - ioctl(IOMMU_IOAS_MAP)\n @size: sizeof(struct iommu_ioas_map)\n @flags: Combination of enum iommufd_ioas_map_flags\n @ioas_id: IOAS ID to change the mapping of\n @__reserved: Must be 0\n @user_va: Userspace pointer to start mapping from\n @length: Number of bytes to map\n @iova: IOVA the mapping was placed at. If IOMMU_IOAS_MAP_FIXED_IOVA is set\n        then this must be provided as input.\n\n Set an IOVA mapping from a user pointer. If FIXED_IOVA is specified then the\n mapping will be established at iova, otherwise a suitable location based on\n the reserved and allowed lists will be automatically selected and returned in\n iova.\n\n If IOMMU_IOAS_MAP_FIXED_IOVA is specified then the iova range must currently\n be unused, existing IOVA cannot be replaced."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_map {
    pub size: __u32,
    pub flags: __u32,
    pub ioas_id: __u32,
    pub __reserved: __u32,
    pub user_va: __u64,
    pub length: __u64,
    pub iova: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_map"][::std::mem::size_of::<iommu_ioas_map>() - 40usize];
    ["Alignment of iommu_ioas_map"][::std::mem::align_of::<iommu_ioas_map>() - 8usize];
    ["Offset of field: iommu_ioas_map::size"]
        [::std::mem::offset_of!(iommu_ioas_map, size) - 0usize];
    ["Offset of field: iommu_ioas_map::flags"]
        [::std::mem::offset_of!(iommu_ioas_map, flags) - 4usize];
    ["Offset of field: iommu_ioas_map::ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_map, ioas_id) - 8usize];
    ["Offset of field: iommu_ioas_map::__reserved"]
        [::std::mem::offset_of!(iommu_ioas_map, __reserved) - 12usize];
    ["Offset of field: iommu_ioas_map::user_va"]
        [::std::mem::offset_of!(iommu_ioas_map, user_va) - 16usize];
    ["Offset of field: iommu_ioas_map::length"]
        [::std::mem::offset_of!(iommu_ioas_map, length) - 24usize];
    ["Offset of field: iommu_ioas_map::iova"]
        [::std::mem::offset_of!(iommu_ioas_map, iova) - 32usize];
};
#[doc = " struct iommu_ioas_map_file - ioctl(IOMMU_IOAS_MAP_FILE)\n @size: sizeof(struct iommu_ioas_map_file)\n @flags: same as for iommu_ioas_map\n @ioas_id: same as for iommu_ioas_map\n @fd: the memfd to map\n @start: byte offset from start of file to map from\n @length: same as for iommu_ioas_map\n @iova: same as for iommu_ioas_map\n\n Set an IOVA mapping from a memfd file.  All other arguments and semantics\n match those of IOMMU_IOAS_MAP."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_map_file {
    pub size: __u32,
    pub flags: __u32,
    pub ioas_id: __u32,
    pub fd: __s32,
    pub start: __u64,
    pub length: __u64,
    pub iova: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_map_file"][::std::mem::size_of::<iommu_ioas_map_file>() - 40usize];
    ["Alignment of iommu_ioas_map_file"][::std::mem::align_of::<iommu_ioas_map_file>() - 8usize];
    ["Offset of field: iommu_ioas_map_file::size"]
        [::std::mem::offset_of!(iommu_ioas_map_file, size) - 0usize];
    ["Offset of field: iommu_ioas_map_file::flags"]
        [::std::mem::offset_of!(iommu_ioas_map_file, flags) - 4usize];
    ["Offset of field: iommu_ioas_map_file::ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_map_file, ioas_id) - 8usize];
    ["Offset of field: iommu_ioas_map_file::fd"]
        [::std::mem::offset_of!(iommu_ioas_map_file, fd) - 12usize];
    ["Offset of field: iommu_ioas_map_file::start"]
        [::std::mem::offset_of!(iommu_ioas_map_file, start) - 16usize];
    ["Offset of field: iommu_ioas_map_file::length"]
        [::std::mem::offset_of!(iommu_ioas_map_file, length) - 24usize];
    ["Offset of field: iommu_ioas_map_file::iova"]
        [::std::mem::offset_of!(iommu_ioas_map_file, iova) - 32usize];
};
#[doc = " struct iommu_ioas_copy - ioctl(IOMMU_IOAS_COPY)\n @size: sizeof(struct iommu_ioas_copy)\n @flags: Combination of enum iommufd_ioas_map_flags\n @dst_ioas_id: IOAS ID to change the mapping of\n @src_ioas_id: IOAS ID to copy from\n @length: Number of bytes to copy and map\n @dst_iova: IOVA the mapping was placed at. If IOMMU_IOAS_MAP_FIXED_IOVA is\n            set then this must be provided as input.\n @src_iova: IOVA to start the copy\n\n Copy an already existing mapping from src_ioas_id and establish it in\n dst_ioas_id. The src iova/length must exactly match a range used with\n IOMMU_IOAS_MAP.\n\n This may be used to efficiently clone a subset of an IOAS to another, or as a\n kind of 'cache' to speed up mapping. Copy has an efficiency advantage over\n establishing equivalent new mappings, as internal resources are shared, and\n the kernel will pin the user memory only once."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_copy {
    pub size: __u32,
    pub flags: __u32,
    pub dst_ioas_id: __u32,
    pub src_ioas_id: __u32,
    pub length: __u64,
    pub dst_iova: __u64,
    pub src_iova: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_copy"][::std::mem::size_of::<iommu_ioas_copy>() - 40usize];
    ["Alignment of iommu_ioas_copy"][::std::mem::align_of::<iommu_ioas_copy>() - 8usize];
    ["Offset of field: iommu_ioas_copy::size"]
        [::std::mem::offset_of!(iommu_ioas_copy, size) - 0usize];
    ["Offset of field: iommu_ioas_copy::flags"]
        [::std::mem::offset_of!(iommu_ioas_copy, flags) - 4usize];
    ["Offset of field: iommu_ioas_copy::dst_ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_copy, dst_ioas_id) - 8usize];
    ["Offset of field: iommu_ioas_copy::src_ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_copy, src_ioas_id) - 12usize];
    ["Offset of field: iommu_ioas_copy::length"]
        [::std::mem::offset_of!(iommu_ioas_copy, length) - 16usize];
    ["Offset of field: iommu_ioas_copy::dst_iova"]
        [::std::mem::offset_of!(iommu_ioas_copy, dst_iova) - 24usize];
    ["Offset of field: iommu_ioas_copy::src_iova"]
        [::std::mem::offset_of!(iommu_ioas_copy, src_iova) - 32usize];
};
#[doc = " struct iommu_ioas_unmap - ioctl(IOMMU_IOAS_UNMAP)\n @size: sizeof(struct iommu_ioas_unmap)\n @ioas_id: IOAS ID to change the mapping of\n @iova: IOVA to start the unmapping at\n @length: Number of bytes to unmap, and return back the bytes unmapped\n\n Unmap an IOVA range. The iova/length must be a superset of a previously\n mapped range used with IOMMU_IOAS_MAP or IOMMU_IOAS_COPY. Splitting or\n truncating ranges is not allowed. The values 0 to U64_MAX will unmap\n everything."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_unmap {
    pub size: __u32,
    pub ioas_id: __u32,
    pub iova: __u64,
    pub length: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_unmap"][::std::mem::size_of::<iommu_ioas_unmap>() - 24usize];
    ["Alignment of iommu_ioas_unmap"][::std::mem::align_of::<iommu_ioas_unmap>() - 8usize];
    ["Offset of field: iommu_ioas_unmap::size"]
        [::std::mem::offset_of!(iommu_ioas_unmap, size) - 0usize];
    ["Offset of field: iommu_ioas_unmap::ioas_id"]
        [::std::mem::offset_of!(iommu_ioas_unmap, ioas_id) - 4usize];
    ["Offset of field: iommu_ioas_unmap::iova"]
        [::std::mem::offset_of!(iommu_ioas_unmap, iova) - 8usize];
    ["Offset of field: iommu_ioas_unmap::length"]
        [::std::mem::offset_of!(iommu_ioas_unmap, length) - 16usize];
};
pub const iommufd_option_IOMMU_OPTION_RLIMIT_MODE: iommufd_option = 0;
pub const iommufd_option_IOMMU_OPTION_HUGE_PAGES: iommufd_option = 1;
#[doc = " enum iommufd_option - ioctl(IOMMU_OPTION_RLIMIT_MODE) and\n                       ioctl(IOMMU_OPTION_HUGE_PAGES)\n @IOMMU_OPTION_RLIMIT_MODE:\n    Change how RLIMIT_MEMLOCK accounting works. The caller must have privilege\n    to invoke this. Value 0 (default) is user based accounting, 1 uses process\n    based accounting. Global option, object_id must be 0\n @IOMMU_OPTION_HUGE_PAGES:\n    Value 1 (default) allows contiguous pages to be combined when generating\n    iommu mappings. Value 0 disables combining, everything is mapped to\n    PAGE_SIZE. This can be useful for benchmarking.  This is a per-IOAS\n    option, the object_id must be the IOAS ID."]
pub type iommufd_option = ::std::os::raw::c_uint;
pub const iommufd_option_ops_IOMMU_OPTION_OP_SET: iommufd_option_ops = 0;
pub const iommufd_option_ops_IOMMU_OPTION_OP_GET: iommufd_option_ops = 1;
#[doc = " enum iommufd_option_ops - ioctl(IOMMU_OPTION_OP_SET) and\n                           ioctl(IOMMU_OPTION_OP_GET)\n @IOMMU_OPTION_OP_SET: Set the option's value\n @IOMMU_OPTION_OP_GET: Get the option's value"]
pub type iommufd_option_ops = ::std::os::raw::c_uint;
#[doc = " struct iommu_option - iommu option multiplexer\n @size: sizeof(struct iommu_option)\n @option_id: One of enum iommufd_option\n @op: One of enum iommufd_option_ops\n @__reserved: Must be 0\n @object_id: ID of the object if required\n @val64: Option value to set or value returned on get\n\n Change a simple option value. This multiplexor allows controlling options\n on objects. IOMMU_OPTION_OP_SET will load an option and IOMMU_OPTION_OP_GET\n will return the current value."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_option {
    pub size: __u32,
    pub option_id: __u32,
    pub op: __u16,
    pub __reserved: __u16,
    pub object_id: __u32,
    pub val64: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_option"][::std::mem::size_of::<iommu_option>() - 24usize];
    ["Alignment of iommu_option"][::std::mem::align_of::<iommu_option>() - 8usize];
    ["Offset of field: iommu_option::size"][::std::mem::offset_of!(iommu_option, size) - 0usize];
    ["Offset of field: iommu_option::option_id"]
        [::std::mem::offset_of!(iommu_option, option_id) - 4usize];
    ["Offset of field: iommu_option::op"][::std::mem::offset_of!(iommu_option, op) - 8usize];
    ["Offset of field: iommu_option::__reserved"]
        [::std::mem::offset_of!(iommu_option, __reserved) - 10usize];
    ["Offset of field: iommu_option::object_id"]
        [::std::mem::offset_of!(iommu_option, object_id) - 12usize];
    ["Offset of field: iommu_option::val64"][::std::mem::offset_of!(iommu_option, val64) - 16usize];
};
pub const iommufd_vfio_ioas_op_IOMMU_VFIO_IOAS_GET: iommufd_vfio_ioas_op = 0;
pub const iommufd_vfio_ioas_op_IOMMU_VFIO_IOAS_SET: iommufd_vfio_ioas_op = 1;
pub const iommufd_vfio_ioas_op_IOMMU_VFIO_IOAS_CLEAR: iommufd_vfio_ioas_op = 2;
#[doc = " enum iommufd_vfio_ioas_op - IOMMU_VFIO_IOAS_* ioctls\n @IOMMU_VFIO_IOAS_GET: Get the current compatibility IOAS\n @IOMMU_VFIO_IOAS_SET: Change the current compatibility IOAS\n @IOMMU_VFIO_IOAS_CLEAR: Disable VFIO compatibility"]
pub type iommufd_vfio_ioas_op = ::std::os::raw::c_uint;
#[doc = " struct iommu_vfio_ioas - ioctl(IOMMU_VFIO_IOAS)\n @size: sizeof(struct iommu_vfio_ioas)\n @ioas_id: For IOMMU_VFIO_IOAS_SET the input IOAS ID to set\n           For IOMMU_VFIO_IOAS_GET will output the IOAS ID\n @op: One of enum iommufd_vfio_ioas_op\n @__reserved: Must be 0\n\n The VFIO compatibility support uses a single ioas because VFIO APIs do not\n support the ID field. Set or Get the IOAS that VFIO compatibility will use.\n When VFIO_GROUP_SET_CONTAINER is used on an iommufd it will get the\n compatibility ioas, either by taking what is already set, or auto creating\n one. From then on VFIO will continue to use that ioas and is not effected by\n this ioctl. SET or CLEAR does not destroy any auto-created IOAS."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_vfio_ioas {
    pub size: __u32,
    pub ioas_id: __u32,
    pub op: __u16,
    pub __reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_vfio_ioas"][::std::mem::size_of::<iommu_vfio_ioas>() - 12usize];
    ["Alignment of iommu_vfio_ioas"][::std::mem::align_of::<iommu_vfio_ioas>() - 4usize];
    ["Offset of field: iommu_vfio_ioas::size"]
        [::std::mem::offset_of!(iommu_vfio_ioas, size) - 0usize];
    ["Offset of field: iommu_vfio_ioas::ioas_id"]
        [::std::mem::offset_of!(iommu_vfio_ioas, ioas_id) - 4usize];
    ["Offset of field: iommu_vfio_ioas::op"][::std::mem::offset_of!(iommu_vfio_ioas, op) - 8usize];
    ["Offset of field: iommu_vfio_ioas::__reserved"]
        [::std::mem::offset_of!(iommu_vfio_ioas, __reserved) - 10usize];
};
pub const iommufd_hwpt_alloc_flags_IOMMU_HWPT_ALLOC_NEST_PARENT: iommufd_hwpt_alloc_flags = 1;
pub const iommufd_hwpt_alloc_flags_IOMMU_HWPT_ALLOC_DIRTY_TRACKING: iommufd_hwpt_alloc_flags = 2;
pub const iommufd_hwpt_alloc_flags_IOMMU_HWPT_FAULT_ID_VALID: iommufd_hwpt_alloc_flags = 4;
pub const iommufd_hwpt_alloc_flags_IOMMU_HWPT_ALLOC_PASID: iommufd_hwpt_alloc_flags = 8;
#[doc = " enum iommufd_hwpt_alloc_flags - Flags for HWPT allocation\n @IOMMU_HWPT_ALLOC_NEST_PARENT: If set, allocate a HWPT that can serve as\n                                the parent HWPT in a nesting configuration.\n @IOMMU_HWPT_ALLOC_DIRTY_TRACKING: Dirty tracking support for device IOMMU is\n                                   enforced on device attachment\n @IOMMU_HWPT_FAULT_ID_VALID: The fault_id field of hwpt allocation data is\n                             valid.\n @IOMMU_HWPT_ALLOC_PASID: Requests a domain that can be used with PASID. The\n                          domain can be attached to any PASID on the device.\n                          Any domain attached to the non-PASID part of the\n                          device must also be flagged, otherwise attaching a\n                          PASID will blocked.\n                          For the user that wants to attach PASID, ioas is\n                          not recommended for both the non-PASID part\n                          and PASID part of the device.\n                          If IOMMU does not support PASID it will return\n                          error (-EOPNOTSUPP)."]
pub type iommufd_hwpt_alloc_flags = ::std::os::raw::c_uint;
pub const iommu_hwpt_vtd_s1_flags_IOMMU_VTD_S1_SRE: iommu_hwpt_vtd_s1_flags = 1;
pub const iommu_hwpt_vtd_s1_flags_IOMMU_VTD_S1_EAFE: iommu_hwpt_vtd_s1_flags = 2;
pub const iommu_hwpt_vtd_s1_flags_IOMMU_VTD_S1_WPE: iommu_hwpt_vtd_s1_flags = 4;
#[doc = " enum iommu_hwpt_vtd_s1_flags - Intel VT-d stage-1 page table\n                                entry attributes\n @IOMMU_VTD_S1_SRE: Supervisor request\n @IOMMU_VTD_S1_EAFE: Extended access enable\n @IOMMU_VTD_S1_WPE: Write protect enable"]
pub type iommu_hwpt_vtd_s1_flags = ::std::os::raw::c_uint;
#[doc = " struct iommu_hwpt_vtd_s1 - Intel VT-d stage-1 page table\n                            info (IOMMU_HWPT_DATA_VTD_S1)\n @flags: Combination of enum iommu_hwpt_vtd_s1_flags\n @pgtbl_addr: The base address of the stage-1 page table.\n @addr_width: The address width of the stage-1 page table\n @__reserved: Must be 0"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_vtd_s1 {
    pub flags: __u64,
    pub pgtbl_addr: __u64,
    pub addr_width: __u32,
    pub __reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_vtd_s1"][::std::mem::size_of::<iommu_hwpt_vtd_s1>() - 24usize];
    ["Alignment of iommu_hwpt_vtd_s1"][::std::mem::align_of::<iommu_hwpt_vtd_s1>() - 8usize];
    ["Offset of field: iommu_hwpt_vtd_s1::flags"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1, flags) - 0usize];
    ["Offset of field: iommu_hwpt_vtd_s1::pgtbl_addr"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1, pgtbl_addr) - 8usize];
    ["Offset of field: iommu_hwpt_vtd_s1::addr_width"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1, addr_width) - 16usize];
    ["Offset of field: iommu_hwpt_vtd_s1::__reserved"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1, __reserved) - 20usize];
};
#[doc = " struct iommu_hwpt_arm_smmuv3 - ARM SMMUv3 nested STE\n                                (IOMMU_HWPT_DATA_ARM_SMMUV3)\n\n @ste: The first two double words of the user space Stream Table Entry for\n       the translation. Must be little-endian.\n       Allowed fields: (Refer to \"5.2 Stream Table Entry\" in SMMUv3 HW Spec)\n       - word-0: V, Cfg, S1Fmt, S1ContextPtr, S1CDMax\n       - word-1: EATS, S1DSS, S1CIR, S1COR, S1CSH, S1STALLD\n\n -EIO will be returned if @ste is not legal or contains any non-allowed field.\n Cfg can be used to select a S1, Bypass or Abort configuration. A Bypass\n nested domain will translate the same as the nesting parent. The S1 will\n install a Context Descriptor Table pointing at userspace memory translated\n by the nesting parent."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_arm_smmuv3 {
    pub ste: [__le64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_arm_smmuv3"][::std::mem::size_of::<iommu_hwpt_arm_smmuv3>() - 16usize];
    ["Alignment of iommu_hwpt_arm_smmuv3"]
        [::std::mem::align_of::<iommu_hwpt_arm_smmuv3>() - 8usize];
    ["Offset of field: iommu_hwpt_arm_smmuv3::ste"]
        [::std::mem::offset_of!(iommu_hwpt_arm_smmuv3, ste) - 0usize];
};
pub const iommu_hwpt_data_type_IOMMU_HWPT_DATA_NONE: iommu_hwpt_data_type = 0;
pub const iommu_hwpt_data_type_IOMMU_HWPT_DATA_VTD_S1: iommu_hwpt_data_type = 1;
pub const iommu_hwpt_data_type_IOMMU_HWPT_DATA_ARM_SMMUV3: iommu_hwpt_data_type = 2;
#[doc = " enum iommu_hwpt_data_type - IOMMU HWPT Data Type\n @IOMMU_HWPT_DATA_NONE: no data\n @IOMMU_HWPT_DATA_VTD_S1: Intel VT-d stage-1 page table\n @IOMMU_HWPT_DATA_ARM_SMMUV3: ARM SMMUv3 Context Descriptor Table"]
pub type iommu_hwpt_data_type = ::std::os::raw::c_uint;
#[doc = " struct iommu_hwpt_alloc - ioctl(IOMMU_HWPT_ALLOC)\n @size: sizeof(struct iommu_hwpt_alloc)\n @flags: Combination of enum iommufd_hwpt_alloc_flags\n @dev_id: The device to allocate this HWPT for\n @pt_id: The IOAS or HWPT or vIOMMU to connect this HWPT to\n @out_hwpt_id: The ID of the new HWPT\n @__reserved: Must be 0\n @data_type: One of enum iommu_hwpt_data_type\n @data_len: Length of the type specific data\n @data_uptr: User pointer to the type specific data\n @fault_id: The ID of IOMMUFD_FAULT object. Valid only if flags field of\n            IOMMU_HWPT_FAULT_ID_VALID is set.\n @__reserved2: Padding to 64-bit alignment. Must be 0.\n\n Explicitly allocate a hardware page table object. This is the same object\n type that is returned by iommufd_device_attach() and represents the\n underlying iommu driver's iommu_domain kernel object.\n\n A kernel-managed HWPT will be created with the mappings from the given\n IOAS via the @pt_id. The @data_type for this allocation must be set to\n IOMMU_HWPT_DATA_NONE. The HWPT can be allocated as a parent HWPT for a\n nesting configuration by passing IOMMU_HWPT_ALLOC_NEST_PARENT via @flags.\n\n A user-managed nested HWPT will be created from a given vIOMMU (wrapping a\n parent HWPT) or a parent HWPT via @pt_id, in which the parent HWPT must be\n allocated previously via the same ioctl from a given IOAS (@pt_id). In this\n case, the @data_type must be set to a pre-defined type corresponding to an\n I/O page table type supported by the underlying IOMMU hardware. The device\n via @dev_id and the vIOMMU via @pt_id must be associated to the same IOMMU\n instance.\n\n If the @data_type is set to IOMMU_HWPT_DATA_NONE, @data_len and\n @data_uptr should be zero. Otherwise, both @data_len and @data_uptr\n must be given."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_alloc {
    pub size: __u32,
    pub flags: __u32,
    pub dev_id: __u32,
    pub pt_id: __u32,
    pub out_hwpt_id: __u32,
    pub __reserved: __u32,
    pub data_type: __u32,
    pub data_len: __u32,
    pub data_uptr: __u64,
    pub fault_id: __u32,
    pub __reserved2: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_alloc"][::std::mem::size_of::<iommu_hwpt_alloc>() - 48usize];
    ["Alignment of iommu_hwpt_alloc"][::std::mem::align_of::<iommu_hwpt_alloc>() - 8usize];
    ["Offset of field: iommu_hwpt_alloc::size"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, size) - 0usize];
    ["Offset of field: iommu_hwpt_alloc::flags"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, flags) - 4usize];
    ["Offset of field: iommu_hwpt_alloc::dev_id"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, dev_id) - 8usize];
    ["Offset of field: iommu_hwpt_alloc::pt_id"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, pt_id) - 12usize];
    ["Offset of field: iommu_hwpt_alloc::out_hwpt_id"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, out_hwpt_id) - 16usize];
    ["Offset of field: iommu_hwpt_alloc::__reserved"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, __reserved) - 20usize];
    ["Offset of field: iommu_hwpt_alloc::data_type"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, data_type) - 24usize];
    ["Offset of field: iommu_hwpt_alloc::data_len"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, data_len) - 28usize];
    ["Offset of field: iommu_hwpt_alloc::data_uptr"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, data_uptr) - 32usize];
    ["Offset of field: iommu_hwpt_alloc::fault_id"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, fault_id) - 40usize];
    ["Offset of field: iommu_hwpt_alloc::__reserved2"]
        [::std::mem::offset_of!(iommu_hwpt_alloc, __reserved2) - 44usize];
};
pub const iommu_hw_info_vtd_flags_IOMMU_HW_INFO_VTD_ERRATA_772415_SPR17: iommu_hw_info_vtd_flags =
    1;
#[doc = " enum iommu_hw_info_vtd_flags - Flags for VT-d hw_info\n @IOMMU_HW_INFO_VTD_ERRATA_772415_SPR17: If set, disallow read-only mappings\n                                         on a nested_parent domain.\n                                         https://www.intel.com/content/www/us/en/content-details/772415/content-details.html"]
pub type iommu_hw_info_vtd_flags = ::std::os::raw::c_uint;
#[doc = " struct iommu_hw_info_vtd - Intel VT-d hardware information\n\n @flags: Combination of enum iommu_hw_info_vtd_flags\n @__reserved: Must be 0\n\n @cap_reg: Value of Intel VT-d capability register defined in VT-d spec\n           section 11.4.2 Capability Register.\n @ecap_reg: Value of Intel VT-d capability register defined in VT-d spec\n            section 11.4.3 Extended Capability Register.\n\n User needs to understand the Intel VT-d specification to decode the\n register value."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hw_info_vtd {
    pub flags: __u32,
    pub __reserved: __u32,
    pub cap_reg: __u64,
    pub ecap_reg: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hw_info_vtd"][::std::mem::size_of::<iommu_hw_info_vtd>() - 24usize];
    ["Alignment of iommu_hw_info_vtd"][::std::mem::align_of::<iommu_hw_info_vtd>() - 8usize];
    ["Offset of field: iommu_hw_info_vtd::flags"]
        [::std::mem::offset_of!(iommu_hw_info_vtd, flags) - 0usize];
    ["Offset of field: iommu_hw_info_vtd::__reserved"]
        [::std::mem::offset_of!(iommu_hw_info_vtd, __reserved) - 4usize];
    ["Offset of field: iommu_hw_info_vtd::cap_reg"]
        [::std::mem::offset_of!(iommu_hw_info_vtd, cap_reg) - 8usize];
    ["Offset of field: iommu_hw_info_vtd::ecap_reg"]
        [::std::mem::offset_of!(iommu_hw_info_vtd, ecap_reg) - 16usize];
};
#[doc = " struct iommu_hw_info_arm_smmuv3 - ARM SMMUv3 hardware information\n                                   (IOMMU_HW_INFO_TYPE_ARM_SMMUV3)\n\n @flags: Must be set to 0\n @__reserved: Must be 0\n @idr: Implemented features for ARM SMMU Non-secure programming interface\n @iidr: Information about the implementation and implementer of ARM SMMU,\n        and architecture version supported\n @aidr: ARM SMMU architecture version\n\n For the details of @idr, @iidr and @aidr, please refer to the chapters\n from 6.3.1 to 6.3.6 in the SMMUv3 Spec.\n\n This reports the raw HW capability, and not all bits are meaningful to be\n read by userspace. Only the following fields should be used:\n\n idr[0]: ST_LEVEL, TERM_MODEL, STALL_MODEL, TTENDIAN , CD2L, ASID16, TTF\n idr[1]: SIDSIZE, SSIDSIZE\n idr[3]: BBML, RIL\n idr[5]: VAX, GRAN64K, GRAN16K, GRAN4K\n\n - S1P should be assumed to be true if a NESTED HWPT can be created\n - VFIO/iommufd only support platforms with COHACC, it should be assumed to be\n   true.\n - ATS is a per-device property. If the VMM describes any devices as ATS\n   capable in ACPI/DT it should set the corresponding idr.\n\n This list may expand in future (eg E0PD, AIE, PBHA, D128, DS etc). It is\n important that VMMs do not read bits outside the list to allow for\n compatibility with future kernels. Several features in the SMMUv3\n architecture are not currently supported by the kernel for nesting: HTTU,\n BTM, MPAM and others."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hw_info_arm_smmuv3 {
    pub flags: __u32,
    pub __reserved: __u32,
    pub idr: [__u32; 6usize],
    pub iidr: __u32,
    pub aidr: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hw_info_arm_smmuv3"]
        [::std::mem::size_of::<iommu_hw_info_arm_smmuv3>() - 40usize];
    ["Alignment of iommu_hw_info_arm_smmuv3"]
        [::std::mem::align_of::<iommu_hw_info_arm_smmuv3>() - 4usize];
    ["Offset of field: iommu_hw_info_arm_smmuv3::flags"]
        [::std::mem::offset_of!(iommu_hw_info_arm_smmuv3, flags) - 0usize];
    ["Offset of field: iommu_hw_info_arm_smmuv3::__reserved"]
        [::std::mem::offset_of!(iommu_hw_info_arm_smmuv3, __reserved) - 4usize];
    ["Offset of field: iommu_hw_info_arm_smmuv3::idr"]
        [::std::mem::offset_of!(iommu_hw_info_arm_smmuv3, idr) - 8usize];
    ["Offset of field: iommu_hw_info_arm_smmuv3::iidr"]
        [::std::mem::offset_of!(iommu_hw_info_arm_smmuv3, iidr) - 32usize];
    ["Offset of field: iommu_hw_info_arm_smmuv3::aidr"]
        [::std::mem::offset_of!(iommu_hw_info_arm_smmuv3, aidr) - 36usize];
};
pub const iommu_hw_info_type_IOMMU_HW_INFO_TYPE_NONE: iommu_hw_info_type = 0;
pub const iommu_hw_info_type_IOMMU_HW_INFO_TYPE_INTEL_VTD: iommu_hw_info_type = 1;
pub const iommu_hw_info_type_IOMMU_HW_INFO_TYPE_ARM_SMMUV3: iommu_hw_info_type = 2;
#[doc = " enum iommu_hw_info_type - IOMMU Hardware Info Types\n @IOMMU_HW_INFO_TYPE_NONE: Used by the drivers that do not report hardware\n                           info\n @IOMMU_HW_INFO_TYPE_INTEL_VTD: Intel VT-d iommu info type\n @IOMMU_HW_INFO_TYPE_ARM_SMMUV3: ARM SMMUv3 iommu info type"]
pub type iommu_hw_info_type = ::std::os::raw::c_uint;
pub const iommufd_hw_capabilities_IOMMU_HW_CAP_DIRTY_TRACKING: iommufd_hw_capabilities = 1;
pub const iommufd_hw_capabilities_IOMMU_HW_CAP_PCI_PASID_EXEC: iommufd_hw_capabilities = 2;
pub const iommufd_hw_capabilities_IOMMU_HW_CAP_PCI_PASID_PRIV: iommufd_hw_capabilities = 4;
#[doc = " enum iommufd_hw_capabilities\n @IOMMU_HW_CAP_DIRTY_TRACKING: IOMMU hardware support for dirty tracking\n                               If available, it means the following APIs\n                               are supported:\n\n                                   IOMMU_HWPT_GET_DIRTY_BITMAP\n                                   IOMMU_HWPT_SET_DIRTY_TRACKING\n\n @IOMMU_HW_CAP_PCI_PASID_EXEC: Execute Permission Supported, user ignores it\n                               when the struct\n                               iommu_hw_info::out_max_pasid_log2 is zero.\n @IOMMU_HW_CAP_PCI_PASID_PRIV: Privileged Mode Supported, user ignores it\n                               when the struct\n                               iommu_hw_info::out_max_pasid_log2 is zero."]
pub type iommufd_hw_capabilities = ::std::os::raw::c_uint;
#[doc = " struct iommu_hw_info - ioctl(IOMMU_GET_HW_INFO)\n @size: sizeof(struct iommu_hw_info)\n @flags: Must be 0\n @dev_id: The device bound to the iommufd\n @data_len: Input the length of a user buffer in bytes. Output the length of\n            data that kernel supports\n @data_uptr: User pointer to a user-space buffer used by the kernel to fill\n             the iommu type specific hardware information data\n @out_data_type: Output the iommu hardware info type as defined in the enum\n                 iommu_hw_info_type.\n @out_capabilities: Output the generic iommu capability info type as defined\n                    in the enum iommu_hw_capabilities.\n @out_max_pasid_log2: Output the width of PASIDs. 0 means no PASID support.\n                      PCI devices turn to out_capabilities to check if the\n                      specific capabilities is supported or not.\n @__reserved: Must be 0\n\n Query an iommu type specific hardware information data from an iommu behind\n a given device that has been bound to iommufd. This hardware info data will\n be used to sync capabilities between the virtual iommu and the physical\n iommu, e.g. a nested translation setup needs to check the hardware info, so\n a guest stage-1 page table can be compatible with the physical iommu.\n\n To capture an iommu type specific hardware information data, @data_uptr and\n its length @data_len must be provided. Trailing bytes will be zeroed if the\n user buffer is larger than the data that kernel has. Otherwise, kernel only\n fills the buffer using the given length in @data_len. If the ioctl succeeds,\n @data_len will be updated to the length that kernel actually supports,\n @out_data_type will be filled to decode the data filled in the buffer\n pointed by @data_uptr. Input @data_len == zero is allowed."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hw_info {
    pub size: __u32,
    pub flags: __u32,
    pub dev_id: __u32,
    pub data_len: __u32,
    pub data_uptr: __u64,
    pub out_data_type: __u32,
    pub out_max_pasid_log2: __u8,
    pub __reserved: [__u8; 3usize],
    pub out_capabilities: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hw_info"][::std::mem::size_of::<iommu_hw_info>() - 40usize];
    ["Alignment of iommu_hw_info"][::std::mem::align_of::<iommu_hw_info>() - 8usize];
    ["Offset of field: iommu_hw_info::size"][::std::mem::offset_of!(iommu_hw_info, size) - 0usize];
    ["Offset of field: iommu_hw_info::flags"]
        [::std::mem::offset_of!(iommu_hw_info, flags) - 4usize];
    ["Offset of field: iommu_hw_info::dev_id"]
        [::std::mem::offset_of!(iommu_hw_info, dev_id) - 8usize];
    ["Offset of field: iommu_hw_info::data_len"]
        [::std::mem::offset_of!(iommu_hw_info, data_len) - 12usize];
    ["Offset of field: iommu_hw_info::data_uptr"]
        [::std::mem::offset_of!(iommu_hw_info, data_uptr) - 16usize];
    ["Offset of field: iommu_hw_info::out_data_type"]
        [::std::mem::offset_of!(iommu_hw_info, out_data_type) - 24usize];
    ["Offset of field: iommu_hw_info::out_max_pasid_log2"]
        [::std::mem::offset_of!(iommu_hw_info, out_max_pasid_log2) - 28usize];
    ["Offset of field: iommu_hw_info::__reserved"]
        [::std::mem::offset_of!(iommu_hw_info, __reserved) - 29usize];
    ["Offset of field: iommu_hw_info::out_capabilities"]
        [::std::mem::offset_of!(iommu_hw_info, out_capabilities) - 32usize];
};
pub const iommufd_hwpt_set_dirty_tracking_flags_IOMMU_HWPT_DIRTY_TRACKING_ENABLE:
    iommufd_hwpt_set_dirty_tracking_flags = 1;
pub type iommufd_hwpt_set_dirty_tracking_flags = ::std::os::raw::c_uint;
#[doc = " struct iommu_hwpt_set_dirty_tracking - ioctl(IOMMU_HWPT_SET_DIRTY_TRACKING)\n @size: sizeof(struct iommu_hwpt_set_dirty_tracking)\n @flags: Combination of enum iommufd_hwpt_set_dirty_tracking_flags\n @hwpt_id: HW pagetable ID that represents the IOMMU domain\n @__reserved: Must be 0\n\n Toggle dirty tracking on an HW pagetable."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_set_dirty_tracking {
    pub size: __u32,
    pub flags: __u32,
    pub hwpt_id: __u32,
    pub __reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_set_dirty_tracking"]
        [::std::mem::size_of::<iommu_hwpt_set_dirty_tracking>() - 16usize];
    ["Alignment of iommu_hwpt_set_dirty_tracking"]
        [::std::mem::align_of::<iommu_hwpt_set_dirty_tracking>() - 4usize];
    ["Offset of field: iommu_hwpt_set_dirty_tracking::size"]
        [::std::mem::offset_of!(iommu_hwpt_set_dirty_tracking, size) - 0usize];
    ["Offset of field: iommu_hwpt_set_dirty_tracking::flags"]
        [::std::mem::offset_of!(iommu_hwpt_set_dirty_tracking, flags) - 4usize];
    ["Offset of field: iommu_hwpt_set_dirty_tracking::hwpt_id"]
        [::std::mem::offset_of!(iommu_hwpt_set_dirty_tracking, hwpt_id) - 8usize];
    ["Offset of field: iommu_hwpt_set_dirty_tracking::__reserved"]
        [::std::mem::offset_of!(iommu_hwpt_set_dirty_tracking, __reserved) - 12usize];
};
pub const iommufd_hwpt_get_dirty_bitmap_flags_IOMMU_HWPT_GET_DIRTY_BITMAP_NO_CLEAR:
    iommufd_hwpt_get_dirty_bitmap_flags = 1;
#[doc = " enum iommufd_hwpt_get_dirty_bitmap_flags - Flags for getting dirty bits\n @IOMMU_HWPT_GET_DIRTY_BITMAP_NO_CLEAR: Just read the PTEs without clearing\n                                        any dirty bits metadata. This flag\n                                        can be passed in the expectation\n                                        where the next operation is an unmap\n                                        of the same IOVA range.\n"]
pub type iommufd_hwpt_get_dirty_bitmap_flags = ::std::os::raw::c_uint;
#[doc = " struct iommu_hwpt_get_dirty_bitmap - ioctl(IOMMU_HWPT_GET_DIRTY_BITMAP)\n @size: sizeof(struct iommu_hwpt_get_dirty_bitmap)\n @hwpt_id: HW pagetable ID that represents the IOMMU domain\n @flags: Combination of enum iommufd_hwpt_get_dirty_bitmap_flags\n @__reserved: Must be 0\n @iova: base IOVA of the bitmap first bit\n @length: IOVA range size\n @page_size: page size granularity of each bit in the bitmap\n @data: bitmap where to set the dirty bits. The bitmap bits each\n        represent a page_size which you deviate from an arbitrary iova.\n\n Checking a given IOVA is dirty:\n\n  data[(iova / page_size) / 64] & (1ULL << ((iova / page_size) % 64))\n\n Walk the IOMMU pagetables for a given IOVA range to return a bitmap\n with the dirty IOVAs. In doing so it will also by default clear any\n dirty bit metadata set in the IOPTE."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_get_dirty_bitmap {
    pub size: __u32,
    pub hwpt_id: __u32,
    pub flags: __u32,
    pub __reserved: __u32,
    pub iova: __u64,
    pub length: __u64,
    pub page_size: __u64,
    pub data: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_get_dirty_bitmap"]
        [::std::mem::size_of::<iommu_hwpt_get_dirty_bitmap>() - 48usize];
    ["Alignment of iommu_hwpt_get_dirty_bitmap"]
        [::std::mem::align_of::<iommu_hwpt_get_dirty_bitmap>() - 8usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::size"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, size) - 0usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::hwpt_id"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, hwpt_id) - 4usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::flags"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, flags) - 8usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::__reserved"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, __reserved) - 12usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::iova"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, iova) - 16usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::length"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, length) - 24usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::page_size"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, page_size) - 32usize];
    ["Offset of field: iommu_hwpt_get_dirty_bitmap::data"]
        [::std::mem::offset_of!(iommu_hwpt_get_dirty_bitmap, data) - 40usize];
};
pub const iommu_hwpt_invalidate_data_type_IOMMU_HWPT_INVALIDATE_DATA_VTD_S1:
    iommu_hwpt_invalidate_data_type = 0;
pub const iommu_hwpt_invalidate_data_type_IOMMU_VIOMMU_INVALIDATE_DATA_ARM_SMMUV3:
    iommu_hwpt_invalidate_data_type = 1;
#[doc = " enum iommu_hwpt_invalidate_data_type - IOMMU HWPT Cache Invalidation\n                                        Data Type\n @IOMMU_HWPT_INVALIDATE_DATA_VTD_S1: Invalidation data for VTD_S1\n @IOMMU_VIOMMU_INVALIDATE_DATA_ARM_SMMUV3: Invalidation data for ARM SMMUv3"]
pub type iommu_hwpt_invalidate_data_type = ::std::os::raw::c_uint;
pub const iommu_hwpt_vtd_s1_invalidate_flags_IOMMU_VTD_INV_FLAGS_LEAF:
    iommu_hwpt_vtd_s1_invalidate_flags = 1;
#[doc = " enum iommu_hwpt_vtd_s1_invalidate_flags - Flags for Intel VT-d\n                                           stage-1 cache invalidation\n @IOMMU_VTD_INV_FLAGS_LEAF: Indicates whether the invalidation applies\n                            to all-levels page structure cache or just\n                            the leaf PTE cache."]
pub type iommu_hwpt_vtd_s1_invalidate_flags = ::std::os::raw::c_uint;
#[doc = " struct iommu_hwpt_vtd_s1_invalidate - Intel VT-d cache invalidation\n                                       (IOMMU_HWPT_INVALIDATE_DATA_VTD_S1)\n @addr: The start address of the range to be invalidated. It needs to\n        be 4KB aligned.\n @npages: Number of contiguous 4K pages to be invalidated.\n @flags: Combination of enum iommu_hwpt_vtd_s1_invalidate_flags\n @__reserved: Must be 0\n\n The Intel VT-d specific invalidation data for user-managed stage-1 cache\n invalidation in nested translation. Userspace uses this structure to\n tell the impacted cache scope after modifying the stage-1 page table.\n\n Invalidating all the caches related to the page table by setting @addr\n to be 0 and @npages to be U64_MAX.\n\n The device TLB will be invalidated automatically if ATS is enabled."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_vtd_s1_invalidate {
    pub addr: __u64,
    pub npages: __u64,
    pub flags: __u32,
    pub __reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_vtd_s1_invalidate"]
        [::std::mem::size_of::<iommu_hwpt_vtd_s1_invalidate>() - 24usize];
    ["Alignment of iommu_hwpt_vtd_s1_invalidate"]
        [::std::mem::align_of::<iommu_hwpt_vtd_s1_invalidate>() - 8usize];
    ["Offset of field: iommu_hwpt_vtd_s1_invalidate::addr"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1_invalidate, addr) - 0usize];
    ["Offset of field: iommu_hwpt_vtd_s1_invalidate::npages"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1_invalidate, npages) - 8usize];
    ["Offset of field: iommu_hwpt_vtd_s1_invalidate::flags"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1_invalidate, flags) - 16usize];
    ["Offset of field: iommu_hwpt_vtd_s1_invalidate::__reserved"]
        [::std::mem::offset_of!(iommu_hwpt_vtd_s1_invalidate, __reserved) - 20usize];
};
#[doc = " struct iommu_viommu_arm_smmuv3_invalidate - ARM SMMUv3 cache invalidation\n         (IOMMU_VIOMMU_INVALIDATE_DATA_ARM_SMMUV3)\n @cmd: 128-bit cache invalidation command that runs in SMMU CMDQ.\n       Must be little-endian.\n\n Supported command list only when passing in a vIOMMU via @hwpt_id:\n     CMDQ_OP_TLBI_NSNH_ALL\n     CMDQ_OP_TLBI_NH_VA\n     CMDQ_OP_TLBI_NH_VAA\n     CMDQ_OP_TLBI_NH_ALL\n     CMDQ_OP_TLBI_NH_ASID\n     CMDQ_OP_ATC_INV\n     CMDQ_OP_CFGI_CD\n     CMDQ_OP_CFGI_CD_ALL\n\n -EIO will be returned if the command is not supported."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_viommu_arm_smmuv3_invalidate {
    pub cmd: [__le64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_viommu_arm_smmuv3_invalidate"]
        [::std::mem::size_of::<iommu_viommu_arm_smmuv3_invalidate>() - 16usize];
    ["Alignment of iommu_viommu_arm_smmuv3_invalidate"]
        [::std::mem::align_of::<iommu_viommu_arm_smmuv3_invalidate>() - 8usize];
    ["Offset of field: iommu_viommu_arm_smmuv3_invalidate::cmd"]
        [::std::mem::offset_of!(iommu_viommu_arm_smmuv3_invalidate, cmd) - 0usize];
};
#[doc = " struct iommu_hwpt_invalidate - ioctl(IOMMU_HWPT_INVALIDATE)\n @size: sizeof(struct iommu_hwpt_invalidate)\n @hwpt_id: ID of a nested HWPT or a vIOMMU, for cache invalidation\n @data_uptr: User pointer to an array of driver-specific cache invalidation\n             data.\n @data_type: One of enum iommu_hwpt_invalidate_data_type, defining the data\n             type of all the entries in the invalidation request array. It\n             should be a type supported by the hwpt pointed by @hwpt_id.\n @entry_len: Length (in bytes) of a request entry in the request array\n @entry_num: Input the number of cache invalidation requests in the array.\n             Output the number of requests successfully handled by kernel.\n @__reserved: Must be 0.\n\n Invalidate iommu cache for user-managed page table or vIOMMU. Modifications\n on a user-managed page table should be followed by this operation, if a HWPT\n is passed in via @hwpt_id. Other caches, such as device cache or descriptor\n cache can be flushed if a vIOMMU is passed in via the @hwpt_id field.\n\n Each ioctl can support one or more cache invalidation requests in the array\n that has a total size of @entry_len * @entry_num.\n\n An empty invalidation request array by setting @entry_num==0 is allowed, and\n @entry_len and @data_uptr would be ignored in this case. This can be used to\n check if the given @data_type is supported or not by kernel."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_invalidate {
    pub size: __u32,
    pub hwpt_id: __u32,
    pub data_uptr: __u64,
    pub data_type: __u32,
    pub entry_len: __u32,
    pub entry_num: __u32,
    pub __reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_invalidate"][::std::mem::size_of::<iommu_hwpt_invalidate>() - 32usize];
    ["Alignment of iommu_hwpt_invalidate"]
        [::std::mem::align_of::<iommu_hwpt_invalidate>() - 8usize];
    ["Offset of field: iommu_hwpt_invalidate::size"]
        [::std::mem::offset_of!(iommu_hwpt_invalidate, size) - 0usize];
    ["Offset of field: iommu_hwpt_invalidate::hwpt_id"]
        [::std::mem::offset_of!(iommu_hwpt_invalidate, hwpt_id) - 4usize];
    ["Offset of field: iommu_hwpt_invalidate::data_uptr"]
        [::std::mem::offset_of!(iommu_hwpt_invalidate, data_uptr) - 8usize];
    ["Offset of field: iommu_hwpt_invalidate::data_type"]
        [::std::mem::offset_of!(iommu_hwpt_invalidate, data_type) - 16usize];
    ["Offset of field: iommu_hwpt_invalidate::entry_len"]
        [::std::mem::offset_of!(iommu_hwpt_invalidate, entry_len) - 20usize];
    ["Offset of field: iommu_hwpt_invalidate::entry_num"]
        [::std::mem::offset_of!(iommu_hwpt_invalidate, entry_num) - 24usize];
    ["Offset of field: iommu_hwpt_invalidate::__reserved"]
        [::std::mem::offset_of!(iommu_hwpt_invalidate, __reserved) - 28usize];
};
pub const iommu_hwpt_pgfault_flags_IOMMU_PGFAULT_FLAGS_PASID_VALID: iommu_hwpt_pgfault_flags = 1;
pub const iommu_hwpt_pgfault_flags_IOMMU_PGFAULT_FLAGS_LAST_PAGE: iommu_hwpt_pgfault_flags = 2;
#[doc = " enum iommu_hwpt_pgfault_flags - flags for struct iommu_hwpt_pgfault\n @IOMMU_PGFAULT_FLAGS_PASID_VALID: The pasid field of the fault data is\n                                   valid.\n @IOMMU_PGFAULT_FLAGS_LAST_PAGE: It's the last fault of a fault group."]
pub type iommu_hwpt_pgfault_flags = ::std::os::raw::c_uint;
pub const iommu_hwpt_pgfault_perm_IOMMU_PGFAULT_PERM_READ: iommu_hwpt_pgfault_perm = 1;
pub const iommu_hwpt_pgfault_perm_IOMMU_PGFAULT_PERM_WRITE: iommu_hwpt_pgfault_perm = 2;
pub const iommu_hwpt_pgfault_perm_IOMMU_PGFAULT_PERM_EXEC: iommu_hwpt_pgfault_perm = 4;
pub const iommu_hwpt_pgfault_perm_IOMMU_PGFAULT_PERM_PRIV: iommu_hwpt_pgfault_perm = 8;
#[doc = " enum iommu_hwpt_pgfault_perm - perm bits for struct iommu_hwpt_pgfault\n @IOMMU_PGFAULT_PERM_READ: request for read permission\n @IOMMU_PGFAULT_PERM_WRITE: request for write permission\n @IOMMU_PGFAULT_PERM_EXEC: (PCIE 10.4.1) request with a PASID that has the\n                           Execute Requested bit set in PASID TLP Prefix.\n @IOMMU_PGFAULT_PERM_PRIV: (PCIE 10.4.1) request with a PASID that has the\n                           Privileged Mode Requested bit set in PASID TLP\n                           Prefix."]
pub type iommu_hwpt_pgfault_perm = ::std::os::raw::c_uint;
#[doc = " struct iommu_hwpt_pgfault - iommu page fault data\n @flags: Combination of enum iommu_hwpt_pgfault_flags\n @dev_id: id of the originated device\n @pasid: Process Address Space ID\n @grpid: Page Request Group Index\n @perm: Combination of enum iommu_hwpt_pgfault_perm\n @__reserved: Must be 0.\n @addr: Fault address\n @length: a hint of how much data the requestor is expecting to fetch. For\n          example, if the PRI initiator knows it is going to do a 10MB\n          transfer, it could fill in 10MB and the OS could pre-fault in\n          10MB of IOVA. It's default to 0 if there's no such hint.\n @cookie: kernel-managed cookie identifying a group of fault messages. The\n          cookie number encoded in the last page fault of the group should\n          be echoed back in the response message."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_pgfault {
    pub flags: __u32,
    pub dev_id: __u32,
    pub pasid: __u32,
    pub grpid: __u32,
    pub perm: __u32,
    pub __reserved: __u32,
    pub addr: __u64,
    pub length: __u32,
    pub cookie: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_pgfault"][::std::mem::size_of::<iommu_hwpt_pgfault>() - 40usize];
    ["Alignment of iommu_hwpt_pgfault"][::std::mem::align_of::<iommu_hwpt_pgfault>() - 8usize];
    ["Offset of field: iommu_hwpt_pgfault::flags"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, flags) - 0usize];
    ["Offset of field: iommu_hwpt_pgfault::dev_id"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, dev_id) - 4usize];
    ["Offset of field: iommu_hwpt_pgfault::pasid"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, pasid) - 8usize];
    ["Offset of field: iommu_hwpt_pgfault::grpid"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, grpid) - 12usize];
    ["Offset of field: iommu_hwpt_pgfault::perm"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, perm) - 16usize];
    ["Offset of field: iommu_hwpt_pgfault::__reserved"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, __reserved) - 20usize];
    ["Offset of field: iommu_hwpt_pgfault::addr"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, addr) - 24usize];
    ["Offset of field: iommu_hwpt_pgfault::length"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, length) - 32usize];
    ["Offset of field: iommu_hwpt_pgfault::cookie"]
        [::std::mem::offset_of!(iommu_hwpt_pgfault, cookie) - 36usize];
};
pub const iommufd_page_response_code_IOMMUFD_PAGE_RESP_SUCCESS: iommufd_page_response_code = 0;
pub const iommufd_page_response_code_IOMMUFD_PAGE_RESP_INVALID: iommufd_page_response_code = 1;
#[doc = " enum iommufd_page_response_code - Return status of fault handlers\n @IOMMUFD_PAGE_RESP_SUCCESS: Fault has been handled and the page tables\n                             populated, retry the access. This is the\n                             \"Success\" defined in PCI 10.4.2.1.\n @IOMMUFD_PAGE_RESP_INVALID: Could not handle this fault, don't retry the\n                             access. This is the \"Invalid Request\" in PCI\n                             10.4.2.1."]
pub type iommufd_page_response_code = ::std::os::raw::c_uint;
#[doc = " struct iommu_hwpt_page_response - IOMMU page fault response\n @cookie: The kernel-managed cookie reported in the fault message.\n @code: One of response code in enum iommufd_page_response_code."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_hwpt_page_response {
    pub cookie: __u32,
    pub code: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_hwpt_page_response"]
        [::std::mem::size_of::<iommu_hwpt_page_response>() - 8usize];
    ["Alignment of iommu_hwpt_page_response"]
        [::std::mem::align_of::<iommu_hwpt_page_response>() - 4usize];
    ["Offset of field: iommu_hwpt_page_response::cookie"]
        [::std::mem::offset_of!(iommu_hwpt_page_response, cookie) - 0usize];
    ["Offset of field: iommu_hwpt_page_response::code"]
        [::std::mem::offset_of!(iommu_hwpt_page_response, code) - 4usize];
};
#[doc = " struct iommu_fault_alloc - ioctl(IOMMU_FAULT_QUEUE_ALLOC)\n @size: sizeof(struct iommu_fault_alloc)\n @flags: Must be 0\n @out_fault_id: The ID of the new FAULT\n @out_fault_fd: The fd of the new FAULT\n\n Explicitly allocate a fault handling object."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_fault_alloc {
    pub size: __u32,
    pub flags: __u32,
    pub out_fault_id: __u32,
    pub out_fault_fd: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_fault_alloc"][::std::mem::size_of::<iommu_fault_alloc>() - 16usize];
    ["Alignment of iommu_fault_alloc"][::std::mem::align_of::<iommu_fault_alloc>() - 4usize];
    ["Offset of field: iommu_fault_alloc::size"]
        [::std::mem::offset_of!(iommu_fault_alloc, size) - 0usize];
    ["Offset of field: iommu_fault_alloc::flags"]
        [::std::mem::offset_of!(iommu_fault_alloc, flags) - 4usize];
    ["Offset of field: iommu_fault_alloc::out_fault_id"]
        [::std::mem::offset_of!(iommu_fault_alloc, out_fault_id) - 8usize];
    ["Offset of field: iommu_fault_alloc::out_fault_fd"]
        [::std::mem::offset_of!(iommu_fault_alloc, out_fault_fd) - 12usize];
};
pub const iommu_viommu_type_IOMMU_VIOMMU_TYPE_DEFAULT: iommu_viommu_type = 0;
pub const iommu_viommu_type_IOMMU_VIOMMU_TYPE_ARM_SMMUV3: iommu_viommu_type = 1;
#[doc = " enum iommu_viommu_type - Virtual IOMMU Type\n @IOMMU_VIOMMU_TYPE_DEFAULT: Reserved for future use\n @IOMMU_VIOMMU_TYPE_ARM_SMMUV3: ARM SMMUv3 driver specific type"]
pub type iommu_viommu_type = ::std::os::raw::c_uint;
#[doc = " struct iommu_viommu_alloc - ioctl(IOMMU_VIOMMU_ALLOC)\n @size: sizeof(struct iommu_viommu_alloc)\n @flags: Must be 0\n @type: Type of the virtual IOMMU. Must be defined in enum iommu_viommu_type\n @dev_id: The device's physical IOMMU will be used to back the virtual IOMMU\n @hwpt_id: ID of a nesting parent HWPT to associate to\n @out_viommu_id: Output virtual IOMMU ID for the allocated object\n\n Allocate a virtual IOMMU object, representing the underlying physical IOMMU's\n virtualization support that is a security-isolated slice of the real IOMMU HW\n that is unique to a specific VM. Operations global to the IOMMU are connected\n to the vIOMMU, such as:\n - Security namespace for guest owned ID, e.g. guest-controlled cache tags\n - Non-device-affiliated event reporting, e.g. invalidation queue errors\n - Access to a sharable nesting parent pagetable across physical IOMMUs\n - Virtualization of various platforms IDs, e.g. RIDs and others\n - Delivery of paravirtualized invalidation\n - Direct assigned invalidation queues\n - Direct assigned interrupts"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_viommu_alloc {
    pub size: __u32,
    pub flags: __u32,
    pub type_: __u32,
    pub dev_id: __u32,
    pub hwpt_id: __u32,
    pub out_viommu_id: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_viommu_alloc"][::std::mem::size_of::<iommu_viommu_alloc>() - 24usize];
    ["Alignment of iommu_viommu_alloc"][::std::mem::align_of::<iommu_viommu_alloc>() - 4usize];
    ["Offset of field: iommu_viommu_alloc::size"]
        [::std::mem::offset_of!(iommu_viommu_alloc, size) - 0usize];
    ["Offset of field: iommu_viommu_alloc::flags"]
        [::std::mem::offset_of!(iommu_viommu_alloc, flags) - 4usize];
    ["Offset of field: iommu_viommu_alloc::type_"]
        [::std::mem::offset_of!(iommu_viommu_alloc, type_) - 8usize];
    ["Offset of field: iommu_viommu_alloc::dev_id"]
        [::std::mem::offset_of!(iommu_viommu_alloc, dev_id) - 12usize];
    ["Offset of field: iommu_viommu_alloc::hwpt_id"]
        [::std::mem::offset_of!(iommu_viommu_alloc, hwpt_id) - 16usize];
    ["Offset of field: iommu_viommu_alloc::out_viommu_id"]
        [::std::mem::offset_of!(iommu_viommu_alloc, out_viommu_id) - 20usize];
};
#[doc = " struct iommu_vdevice_alloc - ioctl(IOMMU_VDEVICE_ALLOC)\n @size: sizeof(struct iommu_vdevice_alloc)\n @viommu_id: vIOMMU ID to associate with the virtual device\n @dev_id: The physical device to allocate a virtual instance on the vIOMMU\n @out_vdevice_id: Object handle for the vDevice. Pass to IOMMU_DESTORY\n @virt_id: Virtual device ID per vIOMMU, e.g. vSID of ARM SMMUv3, vDeviceID\n           of AMD IOMMU, and vRID of a nested Intel VT-d to a Context Table\n\n Allocate a virtual device instance (for a physical device) against a vIOMMU.\n This instance holds the device's information (related to its vIOMMU) in a VM."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_vdevice_alloc {
    pub size: __u32,
    pub viommu_id: __u32,
    pub dev_id: __u32,
    pub out_vdevice_id: __u32,
    pub virt_id: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_vdevice_alloc"][::std::mem::size_of::<iommu_vdevice_alloc>() - 24usize];
    ["Alignment of iommu_vdevice_alloc"][::std::mem::align_of::<iommu_vdevice_alloc>() - 8usize];
    ["Offset of field: iommu_vdevice_alloc::size"]
        [::std::mem::offset_of!(iommu_vdevice_alloc, size) - 0usize];
    ["Offset of field: iommu_vdevice_alloc::viommu_id"]
        [::std::mem::offset_of!(iommu_vdevice_alloc, viommu_id) - 4usize];
    ["Offset of field: iommu_vdevice_alloc::dev_id"]
        [::std::mem::offset_of!(iommu_vdevice_alloc, dev_id) - 8usize];
    ["Offset of field: iommu_vdevice_alloc::out_vdevice_id"]
        [::std::mem::offset_of!(iommu_vdevice_alloc, out_vdevice_id) - 12usize];
    ["Offset of field: iommu_vdevice_alloc::virt_id"]
        [::std::mem::offset_of!(iommu_vdevice_alloc, virt_id) - 16usize];
};
#[doc = " struct iommu_ioas_change_process - ioctl(VFIO_IOAS_CHANGE_PROCESS)\n @size: sizeof(struct iommu_ioas_change_process)\n @__reserved: Must be 0\n\n This transfers pinned memory counts for every memory map in every IOAS\n in the context to the current process.  This only supports maps created\n with IOMMU_IOAS_MAP_FILE, and returns EINVAL if other maps are present.\n If the ioctl returns a failure status, then nothing is changed.\n\n This API is useful for transferring operation of a device from one process\n to another, such as during userland live update."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_ioas_change_process {
    pub size: __u32,
    pub __reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_ioas_change_process"]
        [::std::mem::size_of::<iommu_ioas_change_process>() - 8usize];
    ["Alignment of iommu_ioas_change_process"]
        [::std::mem::align_of::<iommu_ioas_change_process>() - 4usize];
    ["Offset of field: iommu_ioas_change_process::size"]
        [::std::mem::offset_of!(iommu_ioas_change_process, size) - 0usize];
    ["Offset of field: iommu_ioas_change_process::__reserved"]
        [::std::mem::offset_of!(iommu_ioas_change_process, __reserved) - 4usize];
};
pub const iommu_veventq_flag_IOMMU_VEVENTQ_FLAG_LOST_EVENTS: iommu_veventq_flag = 1;
#[doc = " enum iommu_veventq_flag - flag for struct iommufd_vevent_header\n @IOMMU_VEVENTQ_FLAG_LOST_EVENTS: vEVENTQ has lost vEVENTs"]
pub type iommu_veventq_flag = ::std::os::raw::c_uint;
#[doc = " struct iommufd_vevent_header - Virtual Event Header for a vEVENTQ Status\n @flags: Combination of enum iommu_veventq_flag\n @sequence: The sequence index of a vEVENT in the vEVENTQ, with a range of\n            [0, INT_MAX] where the following index of INT_MAX is 0\n\n Each iommufd_vevent_header reports a sequence index of the following vEVENT:\n\n +----------------------+-------+----------------------+-------+---+-------+\n | header0 {sequence=0} | data0 | header1 {sequence=1} | data1 |...| dataN |\n +----------------------+-------+----------------------+-------+---+-------+\n\n And this sequence index is expected to be monotonic to the sequence index of\n the previous vEVENT. If two adjacent sequence indexes has a delta larger than\n 1, it means that delta - 1 number of vEVENTs has lost, e.g. two lost vEVENTs:\n\n +-----+----------------------+-------+----------------------+-------+-----+\n | ... | header3 {sequence=3} | data3 | header6 {sequence=6} | data6 | ... |\n +-----+----------------------+-------+----------------------+-------+-----+\n\n If a vEVENT lost at the tail of the vEVENTQ and there is no following vEVENT\n providing the next sequence index, an IOMMU_VEVENTQ_FLAG_LOST_EVENTS header\n would be added to the tail, and no data would follow this header:\n\n +--+----------------------+-------+-----------------------------------------+\n |..| header3 {sequence=3} | data3 | header4 {flags=LOST_EVENTS, sequence=4} |\n +--+----------------------+-------+-----------------------------------------+"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommufd_vevent_header {
    pub flags: __u32,
    pub sequence: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommufd_vevent_header"][::std::mem::size_of::<iommufd_vevent_header>() - 8usize];
    ["Alignment of iommufd_vevent_header"]
        [::std::mem::align_of::<iommufd_vevent_header>() - 4usize];
    ["Offset of field: iommufd_vevent_header::flags"]
        [::std::mem::offset_of!(iommufd_vevent_header, flags) - 0usize];
    ["Offset of field: iommufd_vevent_header::sequence"]
        [::std::mem::offset_of!(iommufd_vevent_header, sequence) - 4usize];
};
pub const iommu_veventq_type_IOMMU_VEVENTQ_TYPE_DEFAULT: iommu_veventq_type = 0;
pub const iommu_veventq_type_IOMMU_VEVENTQ_TYPE_ARM_SMMUV3: iommu_veventq_type = 1;
#[doc = " enum iommu_veventq_type - Virtual Event Queue Type\n @IOMMU_VEVENTQ_TYPE_DEFAULT: Reserved for future use\n @IOMMU_VEVENTQ_TYPE_ARM_SMMUV3: ARM SMMUv3 Virtual Event Queue"]
pub type iommu_veventq_type = ::std::os::raw::c_uint;
#[doc = " struct iommu_vevent_arm_smmuv3 - ARM SMMUv3 Virtual Event\n                                  (IOMMU_VEVENTQ_TYPE_ARM_SMMUV3)\n @evt: 256-bit ARM SMMUv3 Event record, little-endian.\n       Reported event records: (Refer to \"7.3 Event records\" in SMMUv3 HW Spec)\n       - 0x04 C_BAD_STE\n       - 0x06 F_STREAM_DISABLED\n       - 0x08 C_BAD_SUBSTREAMID\n       - 0x0a C_BAD_CD\n       - 0x10 F_TRANSLATION\n       - 0x11 F_ADDR_SIZE\n       - 0x12 F_ACCESS\n       - 0x13 F_PERMISSION\n\n StreamID field reports a virtual device ID. To receive a virtual event for a\n device, a vDEVICE must be allocated via IOMMU_VDEVICE_ALLOC."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_vevent_arm_smmuv3 {
    pub evt: [__le64; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_vevent_arm_smmuv3"][::std::mem::size_of::<iommu_vevent_arm_smmuv3>() - 32usize];
    ["Alignment of iommu_vevent_arm_smmuv3"]
        [::std::mem::align_of::<iommu_vevent_arm_smmuv3>() - 8usize];
    ["Offset of field: iommu_vevent_arm_smmuv3::evt"]
        [::std::mem::offset_of!(iommu_vevent_arm_smmuv3, evt) - 0usize];
};
#[doc = " struct iommu_veventq_alloc - ioctl(IOMMU_VEVENTQ_ALLOC)\n @size: sizeof(struct iommu_veventq_alloc)\n @flags: Must be 0\n @viommu_id: virtual IOMMU ID to associate the vEVENTQ with\n @type: Type of the vEVENTQ. Must be defined in enum iommu_veventq_type\n @veventq_depth: Maximum number of events in the vEVENTQ\n @out_veventq_id: The ID of the new vEVENTQ\n @out_veventq_fd: The fd of the new vEVENTQ. User space must close the\n                  successfully returned fd after using it\n @__reserved: Must be 0\n\n Explicitly allocate a virtual event queue interface for a vIOMMU. A vIOMMU\n can have multiple FDs for different types, but is confined to one per @type.\n User space should open the @out_veventq_fd to read vEVENTs out of a vEVENTQ,\n if there are vEVENTs available. A vEVENTQ will lose events due to overflow,\n if the number of the vEVENTs hits @veventq_depth.\n\n Each vEVENT in a vEVENTQ encloses a struct iommufd_vevent_header followed by\n a type-specific data structure, in a normal case:\n\n +-+---------+-------+---------+-------+-----+---------+-------+-+\n | | header0 | data0 | header1 | data1 | ... | headerN | dataN | |\n +-+---------+-------+---------+-------+-----+---------+-------+-+\n\n unless a tailing IOMMU_VEVENTQ_FLAG_LOST_EVENTS header is logged (refer to\n struct iommufd_vevent_header)."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct iommu_veventq_alloc {
    pub size: __u32,
    pub flags: __u32,
    pub viommu_id: __u32,
    pub type_: __u32,
    pub veventq_depth: __u32,
    pub out_veventq_id: __u32,
    pub out_veventq_fd: __u32,
    pub __reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iommu_veventq_alloc"][::std::mem::size_of::<iommu_veventq_alloc>() - 32usize];
    ["Alignment of iommu_veventq_alloc"][::std::mem::align_of::<iommu_veventq_alloc>() - 4usize];
    ["Offset of field: iommu_veventq_alloc::size"]
        [::std::mem::offset_of!(iommu_veventq_alloc, size) - 0usize];
    ["Offset of field: iommu_veventq_alloc::flags"]
        [::std::mem::offset_of!(iommu_veventq_alloc, flags) - 4usize];
    ["Offset of field: iommu_veventq_alloc::viommu_id"]
        [::std::mem::offset_of!(iommu_veventq_alloc, viommu_id) - 8usize];
    ["Offset of field: iommu_veventq_alloc::type_"]
        [::std::mem::offset_of!(iommu_veventq_alloc, type_) - 12usize];
    ["Offset of field: iommu_veventq_alloc::veventq_depth"]
        [::std::mem::offset_of!(iommu_veventq_alloc, veventq_depth) - 16usize];
    ["Offset of field: iommu_veventq_alloc::out_veventq_id"]
        [::std::mem::offset_of!(iommu_veventq_alloc, out_veventq_id) - 20usize];
    ["Offset of field: iommu_veventq_alloc::out_veventq_fd"]
        [::std::mem::offset_of!(iommu_veventq_alloc, out_veventq_fd) - 24usize];
    ["Offset of field: iommu_veventq_alloc::__reserved"]
        [::std::mem::offset_of!(iommu_veventq_alloc, __reserved) - 28usize];
};
